<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Load-the-database" data-toc-modified-id="Load-the-database-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Load the database</a></span></li><li><span><a href="#Run-some-queries" data-toc-modified-id="Run-some-queries-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Run some queries</a></span></li><li><span><a href="#postgres-data-types" data-toc-modified-id="postgres-data-types-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>postgres data types</a></span></li><li><span><a href="#Create-new-database-using-pgAdmin" data-toc-modified-id="Create-new-database-using-pgAdmin-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Create new database using pgAdmin</a></span></li><li><span><a href="#Connect-to-the-database" data-toc-modified-id="Connect-to-the-database-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Connect to the database</a></span></li><li><span><a href="#Create-some-tables" data-toc-modified-id="Create-some-tables-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Create some tables</a></span></li><li><span><a href="#Primary-keys-of-given-tables" data-toc-modified-id="Primary-keys-of-given-tables-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Primary keys of given tables</a></span></li><li><span><a href="#Challange:-Create-Table" data-toc-modified-id="Challange:-Create-Table-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Challange: Create Table</a></span></li><li><span><a href="#INSERT-INTO-table-Examples" data-toc-modified-id="INSERT-INTO-table-Examples-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>INSERT INTO table Examples</a></span></li><li><span><a href="#UPDATE-table-Examples" data-toc-modified-id="UPDATE-table-Examples-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>UPDATE table Examples</a></span></li><li><span><a href="#DELETE-FROM-table-examples" data-toc-modified-id="DELETE-FROM-table-examples-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>DELETE FROM table examples</a></span></li><li><span><a href="#DROP-TABLE-table-Example" data-toc-modified-id="DROP-TABLE-table-Example-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>DROP TABLE table Example</a></span></li><li><span><a href="#ALTER-TABLE-table-Examples" data-toc-modified-id="ALTER-TABLE-table-Examples-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>ALTER TABLE table Examples</a></span></li><li><span><a href="#CHECK-Statement" data-toc-modified-id="CHECK-Statement-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>CHECK Statement</a></span></li></ul></div>

# Load the database

In [1]:
import numpy as np
import pandas as pd
import sys
sys.path.append('../utils')

import psycopg2
import util_database
from util_database import *

In [2]:
show_method_attributes(util_database)

,0,1
0,execute_query,show_all_tables_primary_keys
1,get_all_tables_names_in_database,show_df_tables_first_value_and_dtype
2,get_conn,show_given_tables_info
3,get_dataframe_of_all_tables_and_all_columns,show_method_attributes
4,get_pandas_dataframe,show_pandas_dataframes_list
5,get_postgres_configs,show_tables_primary_keys

In [3]:
print(get_postgres_configs.__doc__)

Get the configs for postgres database.

    Example:
    ========
    dbname, dbuser, dbpass, dbport = get_postgres_configs('dvdrental')
    %load_ext sql
    %sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

In [4]:
dbname, dbuser, dbpass, dbport = get_postgres_configs('dvdrental')
%load_ext sql
%sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

'Connected: postgres@dvdrental'

# Run some queries

In [5]:
q = "select * from customer limit 5;"
execute_query(q,dbname)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1

In [6]:
%sql select * from actor limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 (2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))]

In [7]:
%%sql
select * from film limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 (384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")]

# postgres data types

![](../images/sql_data_types.png)
![](../images/postgres_data_types1.png)
![](../images/postgres_data_types2.png)

# Create new database using pgAdmin
- go to pdAdmin and create a database, then we can add tables to it.
- I created a database called `udemysql`

# Connect to the database

In [8]:
print(get_postgres_configs.__doc__)

Get the configs for postgres database.

    Example:
    ========
    dbname, dbuser, dbpass, dbport = get_postgres_configs('dvdrental')
    %load_ext sql
    %sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

In [9]:
dbname, dbuser, dbpass, dbport = get_postgres_configs('udemysql')

In [10]:
%load_ext sql
%sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@udemysql'

# Create some tables

In [11]:
%%sql
CREATE TABLE account(
user_id serial PRIMARY KEY,
username VARCHAR (50) UNIQUE NOT NULL,
password VARCHAR (50) NOT NULL,
email VARCHAR (355) UNIQUE NOT NULL,
created_on TIMESTAMP NOT NULL,
last_login TIMESTAMP
);

CREATE TABLE role(
role_id serial PRIMARY KEY,
role_name VARCHAR (255) UNIQUE NOT NULL
);


CREATE TABLE account_role
(
  user_id integer NOT NULL,
  role_id integer NOT NULL,
  grant_date timestamp without time zone,
  PRIMARY KEY (user_id, role_id),
  CONSTRAINT account_role_role_id_fkey FOREIGN KEY (role_id)
      REFERENCES role (role_id) MATCH SIMPLE
      ON UPDATE NO ACTION ON DELETE NO ACTION,
  CONSTRAINT account_role_user_id_fkey FOREIGN KEY (user_id)
      REFERENCES account (user_id) MATCH SIMPLE
      ON UPDATE NO ACTION ON DELETE NO ACTION
)

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "account" already exists
 [SQL: 'CREATE TABLE account(\nuser_id serial PRIMARY KEY,\nusername VARCHAR (50) UNIQUE NOT NULL,\npassword VARCHAR (50) NOT NULL,\nemail VARCHAR (355) UNIQUE NOT NULL,\ncreated_on TIMESTAMP NOT NULL,\nlast_login TIMESTAMP\n);'] (Background on this error at: http://sqlalche.me/e/f405)

In [12]:
%%sql
select * from account;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

# Primary keys of given tables

In [13]:
from util_database import show_all_tables_primary_keys

dbname = 'udemysql'
show_all_tables_primary_keys(dbname)

      tablename primarykeycolumn
0          role          role_id
1  account_role          user_id
2  account_role          role_id
3       account          user_id
4      customer      customer_id
5         leads          user_id
6          link          link_id
7     new_users               id

# Challange: Create Table

In [14]:
%%sql
CREATE TABLE customer(
customer_id varchar (255) PRIMARY KEY,
first_name varchar(255) not null,
last_name varchar (255) not null,
email varchar(255) unique not null ,
sign_up_date timestamp,
minutes_spent int 

);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "customer" already exists
 [SQL: 'CREATE TABLE customer(\ncustomer_id varchar (255) PRIMARY KEY,\nfirst_name varchar(255) not null,\nlast_name varchar (255) not null,\nemail varchar(255) unique not null ,\nsign_up_date timestamp,\nminutes_spent int \n\n);'] (Background on this error at: http://sqlalche.me/e/f405)

In [15]:
%%sql
select * from customer;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [16]:
%sql drop table leads

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

In [17]:
%%sql
create table leads(
user_id serial primary key,
first_name varchar(50) not null,
last_name varchar(50) not null,
email varchar(255) unique not null,
minutes integer not null,
sign_up_ts timestamp not null
);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

In [18]:
%%sql
select * from leads;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [19]:
show_tables_primary_keys(dbname, 'leads')

  tablename primarykeycolumn
0     leads          user_id

# INSERT INTO table Examples

In [20]:
%%sql
create table link(
ID serial primary key,
url varchar(255) not null,
name varchar(255) not null,
description varchar(255),
rel varchar(50)
);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "link" already exists
 [SQL: 'create table link(\nID serial primary key,\nurl varchar(255) not null,\nname varchar(255) not null,\ndescription varchar(255),\nrel varchar(50)\n);'] (Background on this error at: http://sqlalche.me/e/f405)

In [21]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [22]:
%%sql
insert into link(url,name)
values ('www.google.com', 'Google');

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" of relation "link" does not exist
LINE 1: insert into link(url,name)
                             ^
 [SQL: "insert into link(url,name)\nvalues ('www.google.com', 'Google');"] (Background on this error at: http://sqlalche.me/e/f405)

In [23]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [24]:
%%sql
insert into link(url, name)
values
('www.yahoo.com','Yahoo');

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" of relation "link" does not exist
LINE 1: insert into link(url, name)
                              ^
 [SQL: "insert into link(url, name)\nvalues\n('www.yahoo.com','Yahoo');"] (Background on this error at: http://sqlalche.me/e/f405)

In [25]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [26]:
%%sql
insert into link(url,name)
values
('www.bing.com','Bing'),
('www.amazon.com', 'Amazon');

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" of relation "link" does not exist
LINE 1: insert into link(url,name)
                             ^
 [SQL: "insert into link(url,name)\nvalues\n('www.bing.com','Bing'),\n('www.amazon.com', 'Amazon');"] (Background on this error at: http://sqlalche.me/e/f405)

In [27]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [28]:
%%sql
create table link_copy (like link);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "link_copy" already exists
 [SQL: 'create table link_copy (like link);'] (Background on this error at: http://sqlalche.me/e/f405)

In [29]:
%%sql
select * from link_copy;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
2 rows affected.

[(3, 'www.bing.com', 'Bing', None, None),
 (7, 'www.bing.com', 'Bing', None, None)]

In [30]:
%%sql
insert into link_copy
select * from link
where name = 'Bing';

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" does not exist
LINE 3: where name = 'Bing';
              ^
HINT:  There is a column named "name" in table "link_copy", but it cannot be referenced from this part of the query.
 [SQL: "insert into link_copy\nselect * from link\nwhere name = 'Bing';"] (Background on this error at: http://sqlalche.me/e/f405)

In [31]:
%%sql
select * from link_copy;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
2 rows affected.

[(3, 'www.bing.com', 'Bing', None, None),
 (7, 'www.bing.com', 'Bing', None, None)]

# UPDATE table Examples
```SQL
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;
```

In [32]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [33]:
%%sql
update link
set description = 'Empty Description';

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "description" of relation "link" does not exist
LINE 2: set description = 'Empty Description';
            ^
 [SQL: "update link\nset description = 'Empty Description';"] (Background on this error at: http://sqlalche.me/e/f405)

In [34]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [35]:
%%sql
update link
set description = 'Name starts with A'
where name ilike 'a%';

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" does not exist
LINE 3: where name ilike 'a%';
              ^
 [SQL: "update link\nset description = 'Name starts with A'\nwhere name ilike 'a%%';"] (Background on this error at: http://sqlalche.me/e/f405)

In [36]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [37]:
%%sql
update link
set description = 'Description ' || name
where name = 'Google';

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" does not exist
LINE 3: where name = 'Google';
              ^
 [SQL: "update link\nset description = 'Description ' || name\nwhere name = 'Google';"] (Background on this error at: http://sqlalche.me/e/f405)

In [38]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [39]:
%%sql
update link
set description = 'Changed description'
where id = 2
returning id,url,name,description;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "id" does not exist
LINE 3: where id = 2
              ^
 [SQL: "update link\nset description = 'Changed description'\nwhere id = 2\nreturning id,url,name,description;"] (Background on this error at: http://sqlalche.me/e/f405)

In [40]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

# DELETE FROM table examples

```SQL
DELETE FROM table_name WHERE condition;
```

In [41]:
%%sql
delete from link
where name like 'B%'
returning *;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.UndefinedColumn) column "name" does not exist
LINE 2: where name like 'B%'
              ^
 [SQL: "delete from link\nwhere name like 'B%%'\nreturning *;"] (Background on this error at: http://sqlalche.me/e/f405)

In [42]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

# DROP TABLE table Example

In [43]:
%%sql
drop table if exists link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

# ALTER TABLE table Examples

```SQL
ALTER TABLE table_name
ADD column_name datatype
DROP COLUMN column_name
MODIFY COLUMN column_name datatype
RENAME COLUMN old TO new;


ALTER TABLE table_name new_table_name
```

In [44]:
%%sql
create table link(
link_id serial primary key,
title varchar(255) not null,
url varchar(1024) not null unique
);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

In [45]:
%%sql
alter table link add column active bool;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

In [46]:
%%sql
select * from link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

In [47]:
%%sql
alter table link
rename column title to new_title_name;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
Done.

[]

In [48]:
% sql select *  from  link;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
0 rows affected.

[]

# CHECK Statement

In [49]:
%%sql
create table new_users(
id serial primary key,
first_name varchar(50),
birth_date date check (birth_date > '1900-01-01'),
join_date date check (join_date > birth_date),
salary integer check (salary > 0)
);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "new_users" already exists
 [SQL: "create table new_users(\nid serial primary key,\nfirst_name varchar(50),\nbirth_date date check (birth_date > '1900-01-01'),\njoin_date date check (join_date > birth_date),\nsalary integer check (salary > 0)\n);"] (Background on this error at: http://sqlalche.me/e/f405)

In [50]:
%sql select * from new_users;

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
4 rows affected.

[(2, 'Joe', datetime.date(1980, 2, 2), datetime.date(1990, 4, 4), 10),
 (3, 'Joe', datetime.date(1980, 2, 2), datetime.date(1990, 4, 4), 10),
 (4, 'Joe', datetime.date(1980, 2, 2), datetime.date(1990, 4, 4), 10),
 (5, 'Joe', datetime.date(1980, 2, 2), datetime.date(1990, 4, 4), 10)]

In [51]:
%%sql
insert into new_users(first_name, birth_date, join_date, salary)
values
('Joe', '1980-02-02', '1990-04-04', 10);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
1 rows affected.

[]

In [52]:
%%sql
create table checktest(
sales integer constraint positive_sales check (sales > 0)
);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
(psycopg2.errors.DuplicateTable) relation "checktest" already exists
 [SQL: 'create table checktest(\nsales integer constraint positive_sales check (sales > 0)\n);'] (Background on this error at: http://sqlalche.me/e/f405)

In [53]:
%%sql
insert into checktest(sales)
values
(10);

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
1 rows affected.

[]

In [54]:
%sql select * from checktest

   postgres://postgres:***@localhost:5432/dvdrental
 * postgres://postgres:***@localhost:5432/udemysql
6 rows affected.

[(10,), (10,), (10,), (10,), (10,), (10,)]